IDEA Open Model
WallRect Properties
The WallRect type exposes the following members.
Properties
Name | Description
EccentricityZ
 Displacement in local axis Z
 (Inherited from Element2D.)
Edges
 Lines of Element2D including edges, which are created by opening
 (Inherited from Wall.)
ElementType
 Analysis type - shell, plate, wall
 (Inherited from Element2D.)
GeometricRegion
 Geometry region of element2D
 (Inherited from Element2D.)
GeomId
 Id representing geometrical parts of Detail
 (Inherited from Wall.)
Height
 Height of wall
Id
 Element Id
 (Inherited from OpenElementId.)
InnerLines
 Inner lines of this region
 (Inherited from Element2D.)
InnerPoints
 Inner points of this region
 (Inherited from Element2D.)
InsertPoint
 Insert point 0 - 9
 (Inherited from Wall.)
MasterComponent
 Master component
 (Inherited from Wall.)
MasterPoint
 Master point 0 - 9
 (Inherited from Wall.)
Material
 Material
 (Inherited from Element2D.)
Name
 Name
 (Inherited from Wall.)
Position
 Offset between MasterPoint and InsertPoint If MasterPoint is null, position is from origin of coordinate system
 (Inherited from Wall.)
Thickness
 Thicknes of Element2D
 (Inherited from Element2D.)
Width
 Width of wall
Top
See Also
Reference
WallRect Class
IdeaRS.OpenModel.Detail Namespace